// ConsoleApplication1.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
#include <iostream>
using namespace std;
int main()
{
	setlocale(LC_ALL, "Russian");
	double a;
	double b;
	cout << "Введите два числа:" << '\n';
	cout << "a=";
	cin >> a;
	cout << "b=";
	cin >> b;
	if (b != 0) { cout << '\n' << "Оба числа дробные" << '\n' << "a+b=" << a + b << '\n' << "a-b=" << a - b << '\n' << "a*b=" << a * b << '\n' << "a/b=" << a / b << '\n' << '\n'; }
	else { cout << '\n' << "Оба числа дробные" << '\n' << "a+b=" << a << '\n' << "a-b=" << a << '\n' << "a*b=" << b << '\n' << "Знаменатель не можетбыть равен 0" << '\n' << '\n'; }
	int c = a;
	int d = b;
	if (d != 0) { cout << "Оба числа целые" << '\n' << "a+b=" << c + d << '\n' << "a-b=" << c - d << '\n' << "a*b=" << c * d << '\n' << "a/b=" << c / d << '\n' << '\n'; }
	else { cout << "Оба числа целые" << '\n' << "a+b=" << c << '\n' << "a-b=" << c << '\n' << "a*b=" << d << '\n' <<  "Знаменатель не можетбыть равен 0" << '\n' << '\n'; }
	int e = a;
	double f = b;
	if (f!=0){cout << "a целое, b дробное" << '\n' << "a+b=" << e + f << '\n' << "a-b=" << e - f << '\n' << "a*b=" << e * f << '\n' << "a/b=" << e / f << '\n' << '\n'; }
	else {cout << "a целое, b дробное" << '\n' << "a+b=" << e + f << '\n' << "a-b=" << e - f << '\n' << "a*b=" << e * f << '\n' <<  "Знаменатель не можетбыть равен 0" << '\n' << '\n'; }
	double g = a;
	int h = b;
	if (h!=0){cout << "a дробное, b целое" << '\n' << "a+b=" << g + h << '\n' << "a-b=" << g - h << '\n' << "a*b=" << g * h << '\n' << "a/b=" << g / h; }
	else {cout << "a дробное, b целое" << '\n' << "a+b=" << g << '\n' << "a-b=" << g << '\n' << "a*b=" << h << '\n' << "Знаменатель не можетбыть равен 0"; }
}